app/serializers/athlete_serializer.rb

    def coach_name
      if object.coach
        object.coach.first_name
---
SELECT "coaches".* FROM "coaches" WHERE "coaches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]