app/controllers/application_controller.rb

    def set_current_user
        token = get_token
        if token
            decoded_token = decode_token(token)
            if decoded_token["account_type"] == "athlete"
                @current_user = Athlete.find(decoded_token["athlete_id"])
            elsif decoded_token["account_type"] == "coach"
                @current_user = Coach.find(decoded_token["coach_id"])
---
SELECT "athletes".* FROM "athletes" WHERE "athletes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "coaches".* FROM "coaches" WHERE "coaches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]