app/controllers/athletes_controller.rb

    def login
        athlete = Athlete.find_by(email: params[:email])
---
SELECT "athletes".* FROM "athletes" WHERE "athletes"."email" = $1 LIMIT $2  [["email", "farisaziz12@gmail.com"], ["LIMIT", 1]]

    def create
      athlete = Athlete.create(user_params)
---
INSERT INTO "athletes" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def find_coach
        coach = Coach.find_by(email: params[:coach_email])
        athlete = Athlete.find(params[:id])
---
SELECT "athletes".* FROM "athletes" WHERE "athletes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]