app/controllers/athletes_controller.rb

INSERT INTO "athletes" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
      athlete = Athlete.create(user_params)