app/controllers/coaches_controller.rb

    def login
        coach = Coach.find_by(email: params[:email])
---
SELECT "coaches".* FROM "coaches" WHERE "coaches"."email" = $1 LIMIT $2  [["email", "john@gmail.com"], ["LIMIT", 1]]

    def athlete_workouts
      athlete = Athlete.find(params[:id])
---
SELECT "athletes".* FROM "athletes" WHERE "athletes"."coach_id" = $1  [["coach_id", 1]]

    def create
        coach = Coach.create(user_params)
---
INSERT INTO "coaches" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def find_athlete
      athlete = Athlete.find_by(email: params[:athlete_email])
      coach = Coach.find(params[:id])
---
SELECT "coaches".* FROM "coaches" WHERE "coaches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]