app/controllers/movements_controller.rb

  def index
    movements = Movement.all
---
SELECT "movements".* FROM "movements"

  def show
    movement = Movement.find(params[:id])
---
SELECT "movements".* FROM "movements" WHERE "movements"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]