app/controllers/workouts_controller.rb

  def create
    workout = Workout.create(workout_params)
---
INSERT INTO "workouts" ("name", "wod_type", "category", "date", "workout", "athlete_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    workout = Workout.find(params[:id])
    workout.update(workout_params)
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "workouts" SET "score" = $1, "updated_at" = $2 WHERE "workouts"."id" = $3  [["score", "3 Rounds 8 Reps"], ["updated_at", "2020-02-03 15:40:25.675506"], ["id", 4]]